In [2]:
# examples and exercises in chapter 4.1 of the Chinese version of book "Joyful Pandas" (pandas数据处理与分析)

In [3]:
import numpy as np
import pandas as pd

In [4]:
import os
os.chdir("../../")

In [5]:
# 4.1.1

In [6]:
df = pd.read_csv("data/learn_pandas.csv")
df.groupby("Gender")["Height"].median()

Gender
Female    159.6
Male      173.4
Name: Height, dtype: float64

In [7]:
# Ex4-1

In [8]:
df.groupby("School")["Weight"].mean()

School
A    56.442308
B    55.666667
C    54.000000
D    54.223881
Name: Weight, dtype: float64

In [9]:
# 4.1.2

In [12]:
df.groupby(["School", "Gender"])[["Height", "Weight"]].mean()

                   Height     Weight
School Gender
A      Female  159.122500  48.513514
       Male    176.760000  76.000000
B      Female  158.666667  46.650000
       Male    172.030000  73.700000
C      Female  158.776923  47.900000
       Male    174.212500  72.300000
D      Female  159.753333  48.000000
       Male    171.638889  69.947368

In [13]:
condition = df.Weight > df.Weight.mean()
df.groupby(condition)["Height"].mean()

Weight
False    159.034646
True     172.705357
Name: Height, dtype: float64

In [14]:
# Ex4-2

In [18]:
q_75 = df.Weight.quantile(.75)
q_25 = df.Weight.quantile(.25)

group = df.Weight.apply(lambda x: "high" if x>= q_75 else ("normal" if x > q_25 else "low"))
df.groupby(group)["Height"].mean()

Weight
high      174.511364
low       155.891071
normal    162.174699
Name: Height, dtype: float64

In [19]:
np.random.seed(0)
item = np.random.choice(list("abc"), df.shape[0])
df.groupby(item)["Height"].mean()

a    164.756716
b    163.037931
c    161.620690
Name: Height, dtype: float64

In [20]:
df.groupby([condition, item])["Height"].mean()

Weight
False   a    159.541860
        b    158.787500
        c    158.763636
True    a    174.100000
        b    172.483333
        c    170.600000
Name: Height, dtype: float64

In [21]:
df[["School", "Gender"]].drop_duplicates()

   School  Gender
0       A  Female
1       B    Male
2       A    Male
3       C  Female
4       C    Male
5       D  Female
9       B  Female
16      D    Male

In [22]:
df.groupby([df["School"], df["Gender"]])["Height"].mean()

School  Gender
A       Female    159.122500
        Male      176.760000
B       Female    158.666667
        Male      172.030000
C       Female    158.776923
        Male      174.212500
D       Female    159.753333
        Male      171.638889
Name: Height, dtype: float64

In [23]:
# 4.1.3

In [24]:
gb = df.groupby(["School", "Grade"])
gb

In [25]:
gb.ngroups

16

In [26]:
res = gb.groups
res.keys()

dict_keys([('A', 'Freshman'), ('A', 'Junior'), ('A', 'Senior'), ('A', 'Sophomore'), ('B', 'Freshman'), ('B', 'Junior'), ('B', 'Senior'), ('B', 'Sophomore'), ('C', 'Freshman'), ('C', 'Junior'), ('C', 'Senior'), ('C', 'Sophomore'), ('D', 'Freshman'), ('D', 'Junior'), ('D', 'Senior'), ('D', 'Sophomore')])

In [29]:
df.iloc[:5,:5].size

25

In [30]:
gb.size()

School  Grade
A       Freshman     13
        Junior       17
        Senior       22
        Sophomore     5
B       Freshman     13
        Junior        8
        Senior        8
        Sophomore     5
C       Freshman      9
        Junior       12
        Senior       11
        Sophomore     8
D       Freshman     17
        Junior       22
        Senior       14
        Sophomore    16
dtype: int64

In [33]:
gb.get_group(("A", "Freshman")).iloc[:3,:3]

   School     Grade           Name
0       A  Freshman   Gaopeng Yang
6       A  Freshman      Qiang Chu
10      A  Freshman  Xiaopeng Zhou